Catalogs/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Криптохвост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоступления</Name>
					<Comment>0 - наша эмиссия, 1 - при приемке приходного ордера, 2 - из ЭДО при создании инвойса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипУпаковкиМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВложенныеКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШтрихкодыНоменклатуры/Forms/ФормаЭлемента1/Ext/Form/Module.bsl
&НаСервере
Процедура КодМаркировкиСоЗнакамиПриИзмененииНаСервере()
	// Вставить содержимое обработчика.  
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектЭлемента = Объект.Ссылка.ПолучитьОбъект();
	ОбъектЭлемента.ПолныйКодМаркировки = Новый ХранилищеЗначения(КодМаркировкиСоЗнаками);

КонецПроцедуры

&НаКлиенте
Процедура КодМаркировкиСоЗнакамиПриИзменении(Элемент)
	КодМаркировкиСоЗнакамиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика 
	Попытка
		КодМаркировкиСоЗнаками = Объект.Ссылка.ПолныйКодМаркировки.Получить();
	Исключение 	
	Конецпопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 

	Попытка
		
		ПромКодМаркировкиСоЗнаками = СокрЛП(Объект.Ссылка.ПолныйКодМаркировки.Получить()); 
		КодМаркировкиСоЗнаками     = СтрЗаменить(ПромКодМаркировкиСоЗнаками , Символ(29) , "<GS>");
		
	Исключение		
	Конецпопытки;
//   ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика                                                 
	
	ПромКодМаркировкиСоЗнаками = СтрЗаменить(КодМаркировкиСоЗнаками  , "<GS>" , Символ(29));
	ТекущийОбъект.ПолныйКодМаркировки = Новый ХранилищеЗначения(ПромКодМаркировкиСоЗнаками);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетки(Команда) 
	//+Кабанов А.В. 31.07.2025 # UT10-5345
	МассивШК  = Новый Массив;
	ПолныйШтрихКод = Объект.Ссылка.ПолныйКодМаркировки.Получить(); 
	МассивШК.Добавить(?(ЗначениеЗаполнено(ПолныйШтрихКод),ПолныйШтрихКод,Объект.Ссылка.КодМаркировки));
	Справочники.ШтрихкодыНоменклатуры.ПечатьЭтикеткиМаркировки(МассивШК,"",Ложь); 
	//+Кабанов А.В. 31.07.2025 # UT10-5345
КонецПроцедуры
